# LeaderElbow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..LeaderElbow Property
SpatialElementTag Class See Also
---
The position of the leader's elbow (middle point).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ LeaderElbow { get; set; }
```

Visual Basic
---
```text
Public Property LeaderElbow As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ LeaderElbow {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
Returns the elbow point of the tag leader.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no leader for this tag. -or- When setting this property: SpatialElementTag is pinned. -or- When setting this property: SpatialElementTag is orphaned. |

# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace